<template>
  <div>
    <h2>Главная страница</h2>
    <p>
      SPA приложение создано с приминением Vue CLI. Выбор обусловлен <a href="https://ru.vuejs.org/v2/guide/installation.html#%D0%98%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%BA%D0%BE%D0%BC%D0%B0%D0%BD%D0%B4%D0%BD%D0%BE%D0%B9-%D1%81%D1%82%D1%80%D0%BE%D0%BA%D0%B8-CLI">официальной рекомендацией</a> и отсутсвием коммерческого опыта работы с фреймворком Vue.
    </p>
    <p>
      Главная страница создана, чтобы проверить механизм lazy loading.
    </p>
    <h3>Про калькулятор дробей</h3>
    <p>
      Созданы компоненты:
      <ul>
        <li>Дробь</li>
        <li>Часть выражения (Дробь + оператор)</li>
        <li>Выражение (Несколько частей + Результат ввиде Дроби)</li>
      </ul>
    </p>
    <p>
      Для реализации приоритета операторов применяется <a href="https://www.wikiwand.com/ru/%D0%94%D0%B2%D0%BE%D0%B8%D1%87%D0%BD%D0%BE%D0%B5_%D0%B4%D0%B5%D1%80%D0%B5%D0%B2%D0%BE">бинарное дерево</a> (инфиксная нотация). Вычисление результата через симметричный обход.
    </p>
    <p>
      Дробь сокращается по <a href="https://www.wikiwand.com/ru/%D0%90%D0%BB%D0%B3%D0%BE%D1%80%D0%B8%D1%82%D0%BC_%D0%95%D0%B2%D0%BA%D0%BB%D0%B8%D0%B4%D0%B0">алгоритму Евклида</a>
    </p>
    <p>
      Если в знаменателе дроби содержится 0 или в числителе 0 и знак дроби /, то показывается ошибка "Делить на 0 нельзя". Если не введен числитель или знаменатель, то выводится соответствующая ошибка.
    </p>
    <p>
      Если невозможно получить результат, то отображается символ "X". Если складывается дробь с дробью деленной на 0, то отображается символ бесконечности.
    </p>
    <h3>Про WebSocket</h3>
    <p>
      Созданы компоненты:
      <ul>
        <li>Комментарий (текст + кнопка удалить)</li>
        <li>Список комментариев</li>
      </ul>
    </p>
    <p>
      Все запросы отправляются в json сериализованном виде.
    </p>
    <p>
      Чтобы асинхронно отслеживать ответы сервера создан массив requests. По аналогии с обещаниями, в него помещается каждый посылемый запрос (идентификатор + состояние pending). Если от сервера за 3,5 секунды не пришёл ответ, то состояние меняется на timeouted. Если ответ пришёл менее, чем за 3,5 секунды, то состояние меняется на fulfilled (и удаляется комментарий).
    </p>
    <p>
      В силу недоступности ws://echo.websocket.org из-за действий Роскомназора и для целей тестирования таймаута создан простой websocket echo сервер.
      <pre>node server.js</pre>
      Каждому нечётному запросу на клиенте добавляется action: timeout и сервер на него не отправляет ответ, соотвественно комментарий не удаляется. (Если всё-таки ответ приходит после таймаута, то комментарий также не удаляется.)
    </p>
  </div>
</template>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

</style>
